emsesp/EMS-ESP32/src/system.cpp
    // NTP status
    node = output.createNestedObject("NTP Info");
#ifndef EMSESP_STANDALONE
    node["NTP status"] = EMSESP::system_.ntp_connected() ? "connected" : "disconnected";
    EMSESP::esp8266React.getNTPSettingsService()->read([&](NTPSettings & settings) {
        node["enabled"]  = settings.enabled;
        node["server"]   = settings.server;
        node["tz label"] = settings.tzLabel;
        // node["tz format"] = settings.tzFormat;
    });

    // OTA status
    node = output.createNestedObject("OTA Info");
    EMSESP::esp8266React.getOTASettingsService()->read([&](OTASettings & settings) {
        node["enabled"] = settings.enabled;
        node["port"]    = settings.port;
    });
#endif

    // MQTT Status
    node                = output.createNestedObject("MQTT Info");
    node["MQTT status"] = Mqtt::connected() ? F_(connected) : F_(disconnected);
    if (Mqtt::enabled()) {
        node["MQTT publishes"]     = Mqtt::publish_count();
        node["MQTT queued"]        = Mqtt::publish_queued();
        node["MQTT publish fails"] = Mqtt::publish_fails();
        node["MQTT connects"]      = Mqtt::connect_count();
    }
    EMSESP::esp8266React.getMqttSettingsService()->read([&](MqttSettings & settings) {
        node["enabled"]                 = settings.enabled;
        node["client id"]               = settings.clientId;
        node["keep alive"]              = settings.keepAlive;
        node["clean session"]           = settings.cleanSession;
        node["entity format"]           = settings.entity_format;
        node["base"]                    = settings.base;
        node["discovery prefix"]        = settings.discovery_prefix;
        node["nested format"]           = settings.nested_format;
        node["ha enabled"]              = settings.ha_enabled;
        node["mqtt qos"]                = settings.mqtt_qos;
        node["mqtt retain"]             = settings.mqtt_retain;
        node["publish time heartbeat"]  = settings.publish_time_heartbeat;
        node["publish time boiler"]     = settings.publish_time_boiler;
        node["publish time thermostat"] = settings.publish_time_thermostat;
        node["publish time solar"]      = settings.publish_time_solar;
        node["publish time mixer"]      = settings.publish_time_mixer;
        node["publish time other"]      = settings.publish_time_other;
        node["publish time sensor"]     = settings.publish_time_sensor;
        node["publish single"]          = settings.publish_single;
        node["publish2command"]         = settings.publish_single2cmd;
        node["send response"]           = settings.send_response;
    });

    // Syslog Status
    node            = output.createNestedObject("Syslog Info");
    node["enabled"] = EMSESP::system_.syslog_enabled_;
#ifndef EMSESP_STANDALONE
    if (EMSESP::system_.syslog_enabled_) {
        node["syslog started"] = syslog_.started();
        node["syslog level"]   = FL_(list_syslog_level)[syslog_.log_level() + 1];
        node["syslog ip"]      = syslog_.ip();
        node["syslog queue"]   = syslog_.queued();
    }
#endif

    // Sensor Status
    node = output.createNestedObject("Sensor Info");
    if (EMSESP::dallas_enabled()) {
        node["temperature sensors"]      = EMSESP::dallassensor_.no_sensors();
        node["temperature sensor reads"] = EMSESP::dallassensor_.reads();
        node["temperature sensor fails"] = EMSESP::dallassensor_.fails();
    }
    if (EMSESP::analog_enabled()) {
        node["analog sensors"]      = EMSESP::analogsensor_.no_sensors();
        node["analog sensor reads"] = EMSESP::analogsensor_.reads();
        node["analog sensor fails"] = EMSESP::analogsensor_.fails();
    }

    // API Status
    node              = output.createNestedObject("API Info");
    node["API calls"] = WebAPIService::api_count();
    node["API fails"] = WebAPIService::api_fails();

    // EMS Bus Status
    node = output.createNestedObject("Bus Info");
    switch (EMSESP::bus_status()) {
    case EMSESP::BUS_STATUS_OFFLINE:
        node["bus status"] = "disconnected";
        break;
    case EMSESP::BUS_STATUS_TX_ERRORS:
        node["bus status"] = "connected, tx issues - try a different Tx Mode";
        break;
    case EMSESP::BUS_STATUS_CONNECTED:
        node["bus status"] = "connected";
        break;
    default:
        node["bus status"] = "unknown";
        break;
    }
    if (EMSESP::bus_status() != EMSESP::BUS_STATUS_OFFLINE) {
        node["bus protocol"]                = EMSbus::is_ht3() ? "HT3" : "Buderus";
        node["bus telegrams received (rx)"] = EMSESP::rxservice_.telegram_count();
        node["bus reads (tx)"]              = EMSESP::txservice_.telegram_read_count();
        node["bus writes (tx)"]             = EMSESP::txservice_.telegram_write_count();
        node["bus incomplete telegrams"]    = EMSESP::rxservice_.telegram_error_count();
        node["bus reads failed"]            = EMSESP::txservice_.telegram_read_fail_count();
        node["bus writes failed"]           = EMSESP::txservice_.telegram_write_fail_count();
        node["bus rx line quality"]         = EMSESP::rxservice_.quality();
        node["bus tx line quality"]         = (EMSESP::txservice_.read_quality() + EMSESP::txservice_.read_quality()) / 2;
    }

    // Settings
    node = output.createNestedObject("Settings");
    EMSESP::webSettingsService.read([&](WebSettings & settings) {
        node["board profile"] = settings.board_profile;
        node["locale"]        = settings.locale;
        node["tx mode"]       = settings.tx_mode;
        node["ems bus id"]    = settings.ems_bus_id;
        node["shower timer"]  = settings.shower_timer;
        node["shower alert"]  = settings.shower_alert;
        if (settings.shower_alert) {
            node["shower alert coldshot"] = settings.shower_alert_coldshot; // seconds
            node["shower alert trigger"]  = settings.shower_alert_trigger;  // minutes
        }
        if (settings.board_profile == "CUSTOM") {
            node["phy type"] = settings.phy_type;
            if (settings.phy_type != PHY_type::PHY_TYPE_NONE) {
                node["eth power"]      = settings.eth_power;
                node["eth phy addr"]   = settings.eth_phy_addr;
                node["eth clock_mode"] = settings.eth_clock_mode;
            }
            node["rx gpio"]      = settings.rx_gpio;
            node["tx gpio"]      = settings.tx_gpio;
            node["dallas gpio"]  = settings.dallas_gpio;
            node["pbutton gpio"] = settings.pbutton_gpio;
            node["led gpio"]     = settings.led_gpio;
        }
        node["hide led"]           = settings.hide_led;
        node["notoken api"]        = settings.notoken_api;
        node["readonly mode"]      = settings.readonly_mode;
        node["fahrenheit"]         = settings.fahrenheit;
        node["dallas parasite"]    = settings.dallas_parasite;
        node["bool format"]        = settings.bool_format;
        node["bool dashboard"]     = settings.bool_dashboard;
        node["enum format"]        = settings.enum_format;
        node["analog enabled"]     = settings.analog_enabled;
        node["telnet enabled"]     = settings.telnet_enabled;
        node["max web log buffer"] = settings.weblog_buffer;
        node["web log buffer"]     = EMSESP::webLogService.num_log_messages();
    });

    // Devices - show EMS devices if we have any
    if (!EMSESP::emsdevices.empty()) {
        JsonArray devices = output.createNestedArray("Devices");
        for (const auto & device_class : EMSFactory::device_handlers()) {
            for (const auto & emsdevice : EMSESP::emsdevices) {
                if (emsdevice && (emsdevice->device_type() == device_class.first)) {
                    JsonObject obj    = devices.createNestedObject();
                    obj["type"]       = emsdevice->device_type_name(); // non translated name
                    obj["name"]       = emsdevice->name();
                    obj["device id"]  = Helpers::hextoa(emsdevice->device_id());
                    obj["product id"] = emsdevice->product_id();
                    obj["version"]    = emsdevice->version();
                    obj["entities"]   = emsdevice->count_entities();
                    char result[300];
                    (void)emsdevice->show_telegram_handlers(result, sizeof(result), EMSdevice::Handlers::RECEIVED);
                    if (result[0] != '\0') {
                        obj["handlers received"] = result; // don't show handlers if there aren't any
                    }
                    (void)emsdevice->show_telegram_handlers(result, sizeof(result), EMSdevice::Handlers::FETCHED);
                    if (result[0] != '\0') {
                        obj["handlers fetched"] = result;
                    }
                    (void)emsdevice->show_telegram_handlers(result, sizeof(result), EMSdevice::Handlers::PENDING);
                    if (result[0] != '\0') {
                        obj["handlers pending"] = result;
                    }
                    (void)emsdevice->show_telegram_handlers(result, sizeof(result), EMSdevice::Handlers::IGNORED);
                    if (result[0] != '\0') {
                        obj["handlers ignored"] = result;
                    }
                }
            }
        }
    }

